{
  "id": "réinitialiser_un_mot_de_passe_sur_un_os_linux_via_le_grub",
  "name": "Réinitialiser un mot de passe sur un OS Linux via le Grub",
  "version": "1.0",
  "description": "Réinitialisation MDP du compte root sous OS Linux ",
  "description_long":"copie de https://neptunet.fr/grub-reinit-mdp/\r\nQuoi de plus rageant que de taper un mot de passe sous Linux et de se prendre en retour un « échec de l’authentification », « login incorrect » ou (mon préféré) « désolé l’authentification par mot de passe n’a pas fonctionné » (alors oui sous Windows aussi c’est énervant mais là on va parler uniquement Linux 😊)\r\n\r\nHeureusement pour nous, réinitialiser un mot de passe perdu ou oublié quand on se retrouve bloqué à la fenêtre de connexion est possible, petite astuce du jour sur le sujet !",
  "tags": [],
  "meta": {
    "created_by": "admin",
    "created_at": "2025-07-22"
  },
  "flow": [
    {
      "id": "step1",
      "title": "Réinitialisation MDP du compte root sous Debian 12 sans interface graphique",
      "type": "action",
      "description": "",
      "long_description": "Voici une vue du Grub lorsque l’on démarre une machine Debian : \n<img src='/static/img/grubreinit/MDP-Linux-1.png'>\n\nLors du démarrage, à l’affichage de ce fameux grub, appuyez très rapidement sur la touche « e » du clavier pour arriver sur cet écran :\n<img src='/static/img/grubreinit/MDP-Linux-2.png'>\n\nA l’aide des touches fléchées de votre clavier, descendez et recherchez la ligne commençant par « linux ».\n<img src='/static/img/grubreinit/MDP-Linux-3.png'>\n\nToujours avec les touches fléchées du clavier, allez à la fin de la ligne commençant par linux » et placez vous derrière le mot « quiet ».\n<img src='/static/img/grubreinit/MDP-Linux-4.png'>\n\nDernière le mot « quiet », faites un espace et ajoutez ceci « rw init=/bin/bash » (attention : le clavier peut être en qwerty).\n<img src='/static/img/grubreinit/MDP-Linux-5.png'>\n\nUne fois fait, nous pouvons quitter ce menu en enregistrant bien sur les modifications effectuées. Pour cela, appuyez simultanément sur les touches Ctrl et X du clavier, la machine va redémarrer automatiquement.\n\nSur l’écran qui va s’afficher au redémarrage, nous serons directement connectés en root, prêt pour saisir des lignes de commandes.\n<img src='/static/img/grubreinit/MDP-Linux-6.png'>\n\nIl est maintenant possible de changer le mot de passe du compte root en tapant la commande « passwd » suivi du nouveau mot de passe que l’on veut lui attribuer et en appuyant sur Entrée pour valider l’envoi d’une commande. Attention, le clavier risque d’être toujours en qwerty et vous ne verrez pas le MDP saisi ! Je vous conseille de mettre un mdp simple où les touches sont communes entre un qwerty et un azerty, vous le remplacerez par la suite par un MDP fort quand vous aurez récupéré l’accès normal à la session.\n<img src='/static/img/grubreinit/MDP-Linux-7.png'>\n\nSi c’est pour un autre utilisateur que root, il faut saisir son login dans la commande (exemple : passwd nom_user).\n<img src='/static/img/grubreinit/MDP-Linux-8.png'>\n\nUne fois le MDP modifié, vous pouvez quitter ce mode en saisissant la commande suivante (attention, clavier toujours en qwerty) : <code>exec /sbin/init</code>\n\nVous arriverez directement à la fenêtre de connexion de Debian telle que vous la connaissez.\n<img src='/static/img/grubreinit/MDP-Linux-9.png'>\n\nVous pouvez maintenant vous loguer normalement avec le compte root et son MDP passe que l’on vient de modifier\n<img src='/static/img/grubreinit/MDP-Linux-10.png'>\n\nUne fois connecté, vous pouvez une nouvelle fois changer le MDP en saisissant de nouveau la commande « passwd ».\n\nC’est tout pour cette partie",
      "next":[]
    },
    {
      "id": "step2",
      "title": "Réinitialisation MDP d’un compte local sous Ubuntu Desktop 22",
      "type": "action",
      "description": "",
      "long_description": "Voici une vue du Grub lorsque l’on démarre une machine Ubuntu Desktop :\n<img src='/static/img/grubreinit/MDP-Linux-11.png'>\n\nSi vous n’avez pas le temps de voir l’écran du grub, restez appuyé sur la touche shift (maj) du clavier jusqu’à son affichage lors du démarrage de la machine, avant l’affichage du logo Ubuntu (si vous voyez le logo Ubuntu, il est déjà trop tard et vous devez redémarrer la machine).\n\nQuand vous voyez bien l’écran du grub, descendez sur « Advanced options for Ubuntu » à l’aide des touches fléchées du clavier et appuyez sur Entrée.\n<img src='/static/img/grubreinit/MDP-Linux-12.png'>\n\n A l’écran suivant, descendez sur la première ligne se terminant par « recovery mode » et appuyez sur la touche Entrée.\n<img src='/static/img/grubreinit/MDP-Linux-13.png'>\n\nPatientez le temps du chargement du menu de récupération.\n<img src='/static/img/grubreinit/MDP-Linux-14.png'>\n\nLorsque le menu de récupération est affiché, descendez sur la ligne « root » et appuyez sur Entrée.\n<img src='/static/img/grubreinit/MDP-Linux-15.png'>\n\nDu texte s’affichera en dessous du menu. Appuyez sur Entée pour rentrer en mode maintenance.\n<img src='/static/img/grubreinit/MDP-Linux-16.png'>\n\nNous serons ensuite directement connectés en root, prêt à saisir des commandes.\n<img src='/static/img/grubreinit/MDP-Linux-17.png'>\n\nIl est maintenant possible de changer le mot de passe d’un compte en tapant la commande « passwd nom_user » suivi du nouveau mot de passe que l’on veut lui attribuer.\n<img src='/static/img/grubreinit/MDP-Linux-18.png'>\n\nUn message peut avertir que le mot de passe est trop faible mais il n’empêche pas la modification. Privilégiez tout de même des mots de passe robustes bien évidemment.\n\nSi vous ne connaissez pas le login précis de l’utilisateur concerné par ce changement de MDP, tapez « cat /etc/passwd » pour afficher la liste des utilisateurs sur la machine. En général, l’utilisateur recherché aura un dossier « /home » affecté, son identifiant précis (login) est le nom qui apparait au début de la ligne le concernant. Evitez de toucher les autres utilisateurs qui sont liés aux services ou au système lui-même.\n<img src='/static/img/grubreinit/MDP-Linux-19.png'>\n\nUne fois terminée, vous pouvez quitter le mode maintenance avec la commande « reboot ».\n\nVous pouvez maintenant vous loguer normalement avec le compte et le mot de passe que l’on vient de modifier.\n<img src='/static/img/grubreinit/MDP-Linux-20.png'>\n\nVous arriverez sur l’environnement de travail habituel de l’utilisateur.\n\nC’est tout pour cette partie",
      "next": []
    },
    {
      "id": "step3",
      "title": "Réinitialisation MDP d’un compte local sous CentOS 9 avec SELinux actif",
      "type": "action",
      "description": "",
      "long_description": "Voici une vue du Grub lorsque l’on démarre une machine sous CentOS :\n<img src='/static/img/grubreinit/MDP-Linux-21.png'>\n\nLors du démarrage, à l’affichage du grub (image précédente), appuyez très rapidement sur la touche « e » du clavier pour arriver sur cet écran.\n<img src='/static/img/grubreinit/MDP-Linux-22.png'>\n\nA l’aide des touches fléchées du clavier, descendez et recherchez la ligne commençant par « linux ».\n<img src='/static/img/grubreinit/MDP-Linux-23.png'>\n\nToujours avec les touches fléchées du clavier, déplacez vous à la fin de la ligne commençant par « linux », derrière le mot « quiet ».\n<img src='/static/img/grubreinit/MDP-Linux-24.png'>\n\nSupprimez les paramètres « rhgb » et « quiet » et ajoutez à la place les paramètres suivants : break enforcing=0\n\nAttention : le clavier peut être en qwerty. Le caractère derrière le = est un zéro.\n\nVous aurez une vue ressemblant à ceci :\n<img src='/static/img/grubreinit/MDP-Linux-25.png'>\n\nInfo + : Le paramètre « enforcing=0 » va passer SELinux en mode permissif, c’est-à-dire qu’il alertera mais ne bloquera pas. Il faudra le repasser en mode forcé à la fin de l’opération.\n\nUne fois les modifications effectuées, vous pouvez quitter ce menu en enregistrant les modifications en appuyant simultanément sur les touches Ctrl et X du clavier, la machine va redémarrer automatiquement.\n\nUn prompt commençant par « switch_root » va apparaître et nous pourrons saisir des commandes.\n<img src='/static/img/grubreinit/MDP-Linux-26.png'>\n\nA cette étape, le système de fichier est en lecture seule, nous ne pouvons pas encore modifier un mot de passe. Passez l’accès en écriture et changez le répertoire racine avec les 2 commandes suivantes :\n<code>mount -o remount,rw /sysroot\nchroot /sysroot</code>\n\nLe prompt changera et commencera par « sh- ».\n\nIl est maintenant possible de changer le mot de passe d’un compte utilisateur (root ou autre) en tapant la commande « passwd nom-user » (remplacez « nom-user » par le login de votre propre utilisateur). Si la réinitialisation concerne directement le compte « root », écrivez juste la commande « passwd », suivi du nouveau mot de passe que l’on veut lui attribuer.\n<img src='/static/img/grubreinit/MDP-Linux-29.png'>\n\nUn message peut avertir que le mot de passe est trop faible mais il n’empêche pas la modification. Privilégiez tout de même des mots de passe robustes bien évidemment. Quittez ce mode avec la commande « exit » pour revenir au prompt commençant par « switch_root ».\n<img src='/static/img/grubreinit/MDP-Linux-30.png'>\n\nSaisissez une seconde fois la commande « exit » pour quitter définitivement ce mode et revenir à la fenêtre de connexion d’un utilisateur.\n\nvous pouvez désormais vous loguer normalement avec le compte et le mot de passe que l’on vient de modifier.\n<img src='/static/img/grubreinit/MDP-Linux-31.png'>\n\nVous arriverez sur votre environnement de travail habituel.\n\nComme nous avons passé SELinux en mode passif, il faut encore effectuer 2 petites manipulations pour tout remettre propre. Depuis la session d’un utilisateur, ouvrez un terminal.\n\nIl faut remettre le fichier /etc/shadow dans le contexte de sécurité se SELinux avec la commande suivante :\n<code>sudo restorecon /etc/shadow</code>\n<img src='/static/img/grubreinit/MDP-Linux-32.png'>\n\nInfo + : Si vous êtes connecté directement en root, vous n’avez pas besoin d’utiliser « sudo ».\n\nEt enfin nous allons repasser SELinux en mode forcé avec cette commande :\n<code>setenforce 1</code>\n\nSi on vérifie avec la commande « sestatus » ou « getenforce », nous verrons que SELinux a bien été remis en mode forcé.\n<img src='/static/img/grubreinit/MDP-Linux-32.png'>\n\nEt voilà tout est remis en place, c’est tout pour cette partie smile.",
      "next": []
    }
  ]
}